Octopus/InformationRegisters/vrgОстаткиЗаказовПоставщикамМобильные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиЗаказовПоставщикамМобильные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/InformationRegisters/vrgОстаткиНаСкладахМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиНаСкладахМобильныеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/InformationRegisters/ФотоДляВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ФотоДляВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgРеализацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgИнвентаризацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgЗаказКлиентаМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgВозвратМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgТребованияНакладнаяМобыльный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgИнвентаризацияМобильная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерФото</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/CommonModules/ПроцедурыОбменаДанными/Ext/Module.bsl
Функция ПолучитьПрокси() Экспорт
	
		Адрес 		 = Константы.АдресПодключенияКБазе.Получить();
		Пользователь = Константы.ИмяПользователяДляПодключенияКБазе.Получить();
		Пароль 		 = Константы.ПарольПользователяДляПодключенияКБазе.Получить();
		
	
	Если НЕ ЗначениеЗаполнено(Адрес) Тогда
		Сообщить("Не заповнено адресу підключення до стаціонарної бази.");
		Возврат Неопределено;
	КонецЕсли;                                                 

	Попытка
		SSL = Новый ЗащищенноеСоединениеOpenSSL();
		//SSL  = Неопределено;
		
		Адрес = Адрес + "/ws/mobileSto.1cws?wsdl";
		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль,,,);
		

		Прокси = Новый WSПрокси(Определения, "http://www.1c.ru/SB/MobileExchange", "MobileExchange", "MobileExchangeSoap",,,);
		
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль = Пароль;
	Исключение
		Сообщить("Не вдалося встановити WS-з'єднання зі стаціонарною базою.
		|Перевірте параметри підключення. Причина:"+ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

	Возврат Прокси;

КонецФункции

Функция ОбновитьИндексыПоиска() Экспорт 
	
	ПолнотекстовыйПоиск.ОбновитьИндекс(,Истина);
	Возврат Истина;
	
КонецФункции	

Функция Пинг() Экспорт

	Адрес 		 = Константы.АдресПодключенияКБазе.Получить();
	Пользователь = Константы.ИмяПользователяДляПодключенияКБазе.Получить();
	Пароль 		 = Константы.ПарольПользователяДляПодключенияКБазе.Получить();

	Адрес = Адрес + "/ws/mobilesto.1cws?wsdl";
	Определения = Новый WSОпределения(Адрес,Пользователь,Пароль);

	Прокси = Новый WSПрокси(Определения, "http://www.1c.ru/SB/MobileExchange", "MobileExchange", "MobileExchangeSoap");
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;

	Возврат Прокси.Пинг();

КонецФункции



Процедура УдалениеДанных(Данные) Экспорт

	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда

		Данные = Новый УдалениеОбъекта(Данные.Ссылка);

	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда

		Данные.Очистить();

	КонецЕсли;

КонецПроцедуры

Функция НуженПереносДанных(Данные, УзелОбмена) Экспорт
	Возврат Истина;
КонецФункции

Процедура ЗаписатьДанные(ЗаписьXML, Данные) Экспорт
	ЗаписатьXML(ЗаписьXML, Данные);
КонецПроцедуры


Процедура ОчиститьРегистры()
	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.vrgЦеныНоменклатурыМобильныеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.vrgОстаткиЗаказовПоставщикамМобильные.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	//НаборЗаписей = РегистрыСведений.ПарметрыПроксиБаз.СоздатьНаборЗаписей();
	//НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.НоменклатураПодбора.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
КонецПроцедуры



Функция СнятьРегистрацию() Экспорт 
	УзелСтационарнойБазы = ПланыОбмена.Мобильные.НайтиПоКоду("Г");
	Если ЗначениеЗаполнено(УзелСтационарнойБазы)Тогда 
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелСтационарнойБазы);		
	КонецЕсли;
	Сообщить("Готово!");
КонецФункции

Функция ПолучитьСписокДокументовИнвентаризацияВРознице(Дата,Магазин) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ГУИДСклада", Магазин.УникальныйИдентификатор());
	ДополнительныеПараметры.Вставить("КодСклада", Магазин.Код);
	
	// + ПаламарчукН 01.07.2020
	КодМагазина = "";
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси(Магазин,КодМагазина);
	// - ПаламарчукН 01.07.2020
	ДополнительныеПараметры.Вставить("КодМагазина", КодМагазина);

	Данные = Прокси.ПолучитьСписокДокументовИнвентаризацияВРознице("01",
																	Дата,
																	Новый ХранилищеЗначения(ДополнительныеПараметры, Новый СжатиеДанных(9)));
																	
	ТаблицаЗначений = Данные.Получить();	
	
	Возврат ТаблицаЗначений;
	
КонецФункции



Функция ЭтоУТ(Склад) Экспорт 
	
	ЭтоУТ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда 
		Возврат ЭтоУТ;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПарметрыПроксиБаз.Склад,
		|	ПарметрыПроксиБаз.КодМагазина КАК КодМагазина
		|ИЗ
		|	РегистрСведений.ПарметрыПроксиБаз КАК ПарметрыПроксиБаз
		|ГДЕ
		|	ПарметрыПроксиБаз.Склад = &Склад
		|";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ЭтоУТ = НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КодМагазина);		
	КонецЕсли;
	
	Возврат ЭтоУТ;
	
КонецФункции



///-ВладЧ

//+ВладЧ
Функция ПолучитьТаблицуБезФото()  Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	
	// + ПаламарчукН 01.07.2020
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси();
	// - ПаламарчукН 01.07.2020

	Данные = Прокси.ПолучитьТаблицуБезФото(
								Новый ХранилищеЗначения(ДополнительныеПараметры, Новый СжатиеДанных(9)));
																	
	ТаблицаЗначений = Данные.Получить();
	
	
	Возврат ТаблицаЗначений;

КонецФункции

Функция НайтиНоменклатуру(СтрокаПоиска)  Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокаПоиска",СтрокаПоиска);
	// + ПаламарчукН 01.07.2020
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси();
	// - ПаламарчукН 01.07.2020

	Данные = Прокси.НайтиНоменклатуру(
								Новый ХранилищеЗначения(ДополнительныеПараметры, Новый СжатиеДанных(9)));
																	
	ТаблицаЗначений = Данные.Получить();
	
	
	Возврат ТаблицаЗначений;

КонецФункции

//-ВладЧ


Функция ПолучитьСписокОтсканированныхШтрихкодовИнвентаризацияВУТ(УникальныйИдентификаторДокумента, Магазин ,ИмяДокумента) Экспорт
	//+Влад
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ГУИДСклада", Магазин.УникальныйИдентификатор());
	ДополнительныеПараметры.Вставить("КодСклада", Магазин.Код);
	
	КодМагазина="";
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси(,КодМагазина);
	ДополнительныеПараметры.Вставить("КодМагазина", КодМагазина);
		
	Данные = Прокси.ПолучитьСписокОтсканированныхШтрихкодовДокументаИнвентаризацияВУТ("01",
																УникальныйИдентификаторДокумента,
																СокрЛП(ИмяДокумента),
																Новый ХранилищеЗначения(ДополнительныеПараметры, Новый СжатиеДанных(9)));
	Возврат Данные.Получить();
	//+Влад
КонецФункции


Функция ПолучитьСписокОтсканированныхШтрихкодовПеремещения(УникальныйИдентификаторДокумента,ИмяДокумента) Экспорт
	//+Влад
	ДополнительныеПараметры = Новый Структура;
	
	КодМагазина="";
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси(,КодМагазина);
	ДополнительныеПараметры.Вставить("КодМагазина", КодМагазина);
		
	Данные = Прокси.ПолучитьСписокОтсканированныхДокументПеремещения("01",
																УникальныйИдентификаторДокумента,
																СокрЛП(ИмяДокумента),
																Новый ХранилищеЗначения(ДополнительныеПараметры, Новый СжатиеДанных(9)));
	
	
	Возврат Данные.Получить();
	//+Влад
КонецФункции

Функция ДесериализаторJSON(ДанныеВходные) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеВходные);
	ДанныеВозврат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат ДанныеВозврат;

КонецФункции



Функция ПолучитьСписокОтсканированныхШтрихкодовИнвентаризацияВРознице(УникальныйИдентификаторДокумента, Магазин ,ИмяДокумента) Экспорт

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ГУИДСклада", Магазин.УникальныйИдентификатор());
	ДополнительныеПараметры.Вставить("КодСклада", Магазин.Код);
	
	// + ПаламарчукН 01.07.2020
	КодМагазина="";
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси(Магазин,КодМагазина);
	ДополнительныеПараметры.Вставить("КодМагазина", КодМагазина);
	// - ПаламарчукН 01.07.2020
	
	Данные = Прокси.ПолучитьСписокОтсканированныхШтрихкодовДокументаИнвентаризацияВРознице("01",
																УникальныйИдентификаторДокумента,
																СокрЛП(ИмяДокумента),
																Новый ХранилищеЗначения(ДополнительныеПараметры, Новый СжатиеДанных(9)));
	Возврат Данные.Получить();

КонецФункции


функция ОтправкаФотоПриОбмене() Экспорт 
	
	Запрос_1 = Новый Запрос;
	Запрос_1.Текст = 
	"ВЫБРАТЬ
	|	ФотоДляВыгрузки.УИД КАК УИД,
	|	ФотоДляВыгрузки.Док КАК Док
	|ИЗ
	|	РегистрСведений.ФотоДляВыгрузки КАК ФотоДляВыгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ФотоДляВыгрузки.УИД,
	|	ФотоДляВыгрузки.Док";
	
	РезультатЗапроса_1 = Запрос_1.Выполнить();
	
	ВыборкаДетальныеЗаписи_1 = РезультатЗапроса_1.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи_1.Следующий() Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотоДляВыгрузки.НомерФото КАК ИмяФайла,
		|	ФотоДляВыгрузки.ДатаСоздания КАК ДатаСоздания,
		|	ФотоДляВыгрузки.Фото КАК Фото
		|ИЗ
		|	РегистрСведений.ФотоДляВыгрузки КАК ФотоДляВыгрузки
		|ГДЕ
		|	ФотоДляВыгрузки.УИД = &НомерДетали";
		
		Запрос.УстановитьПараметр("НомерДетали",	ВыборкаДетальныеЗаписи_1.УИД);
		
		РезультатЗапроса	= Запрос.Выполнить();
		
		ТаблицаРезультата	= РезультатЗапроса.Выгрузить();
		
		ХранилищеТаблицы	= Новый ХранилищеЗначения(ТаблицаРезультата);
		
		Прокси = ПолучитьПрокси();
		
		Если Прокси = Неопределено Тогда
			Возврат -1;
		КонецЕсли;
		
		//Попытка 
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи_1.Док) Тогда 
			Док = Null;
			Если ТипЗнч(ВыборкаДетальныеЗаписи_1.Док) = Тип("ДокументСсылка.vrgТребованияНакладнаяМобыльный") Тогда 
				//Док = Документы.vrgТребованияНакладнаяМобыльный.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи_1.УИД));
				Док = ВыборкаДетальныеЗаписи_1.Док;
				ТипДок = "Требование";
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи_1.Док) = Тип("ДокументСсылка.vrgРеализацияМобильная") Тогда 
				//Док = Документы.vrgРеализацияМобильная.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи_1.УИД));
				Док = ВыборкаДетальныеЗаписи_1.Док;

				ТипДок = "РТИУ";
				
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи_1.Док) = Тип("ДокументСсылка.vrgЗаказКлиентаМобильный") Тогда 
				//Док = Документы.vrgРеализацияМобильная.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи_1.УИД));
				Док = ВыборкаДетальныеЗаписи_1.Док;
                          
				ТипДок = "ЗаказПокупателя";
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи_1.Док) = Тип("ДокументСсылка.vrgВозвратМобильный") Тогда 
				//Док = Документы.vrgРеализацияМобильная.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи_1.УИД));
				Док = ВыборкаДетальныеЗаписи_1.Док;
                          
				ТипДок = "ВозвратПокупателю";
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи_1.Док) = Тип("ДокументСсылка.vrgИнвентаризацияМобильная") Тогда 
				//Док = Документы.vrgРеализацияМобильная.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи_1.УИД));
				Док = ВыборкаДетальныеЗаписи_1.Док;
                          
				ТипДок = "Инвентаризация";

			КонецЕсли;
			
						
			Если ЗначениеЗаполнено(Док) Тогда
				
				Номер = Док.Номер;
							
				ОтветСервера = Прокси.ЗагрузитьФото(Номер, ХранилищеТаблицы,ТипДок,Док.УИДДокумента);
				
				Если ЗначениеЗаполнено(ОтветСервера) Тогда
					Для Каждого СтрокаФото Из ТаблицаРезультата Цикл
						МенеджерЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.УИД	= ВыборкаДетальныеЗаписи_1.УИД;
						МенеджерЗаписи.НомерФото	= СтрокаФото.ИмяФайла;
						МенеджерЗаписи.Прочитать();
						
						Если МенеджерЗаписи.Выбран() Тогда
							МенеджерЗаписи.Удалить();
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
			
			
			//Исключение
		//КонецПопытки;
	КонецЦикла;
	
	//Сообщить("Все фотографии отправленны!");
	
	Возврат ОтветСервера;
	//-NovashIV_19.02.2023
КонецФункции

//Функция СоздатьНовуюТорговуюТочку(СтруктураПараметров) Экспорт

//	ТекстОшибки = "";
//	РезультатОбмена = Истина;
//	Прокси = ПолучитьПрокси();
//	ДанныеОбмена = Прокси.СоздатьНовуюТорговуюТочку(Константы.КодУстройства.Получить(),
//													Новый ХранилищеЗначения(СтруктураПараметров, Новый СжатиеДанных(9)),
//													ТекстОшибки);

//	Попытка
//		ЧтениеXML = Новый ЧтениеXML;
//		ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());

//		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
//		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
//		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);

//		НачатьТранзакцию();
//		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
//			Данные = ПрочитатьXML(ЧтениеXML);
//			Если Не Данные = Неопределено Тогда
//				Данные.ОбменДанными.Загрузка = Истина;
//				Данные.Записать();
//			КонецЕсли;
//		КонецЦикла;
//		ЗафиксироватьТранзакцию();
//		ЧтениеСообщения.ЗакончитьЧтение();
//		ЧтениеXML.Закрыть();
//		Возврат Данные.Ссылка;
//	Исключение
//		ТекстОшибки = ТекстОшибки + ОписаниеОшибки();
//	КонецПопытки;

//	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
//		Сообщить(ТекстОшибки);
//		Возврат Неопределено;
//	КонецЕсли;

//КонецФункции
